// 004. Var

int main()
{ // 함수의 시작
	// 함수의 시작과 함수의 끝 사이를 
	// 스코프 혹은 지역이라고 부릅니다.

	// 지역에 선언된 숫자
	// 지역에 선언된 메모리라고 합니다.
	10; // <= 이런 고정된 숫자를 상수라고 부릅니다.

	// 열거형
	// 사용자 정의 자료형
	// 정수형
	// 실수형
	// 논리형

	// 이런 형들에는 
	// 그것을 표현하기 위한 자료형이 있고
	// 그다음에 이름을 붙여주는것이 기본입니다.

	//  자료형   이름
	int      PlayerAtt;
	// 정수 PlayerAtt를 만들어야 해.

	int      PlayerHp;
	int      MonsterHp;
	int      MonsterAtt;

	// 자료형이 표현하는 의미가 있고
	// 이름이 표현하는 의미가 있게 됩니다.

	// 자료형의 의미
	// 1. 바이트 크기 << int 는 4바이트이다.
	// 2. 처리형태	<< 그리고 정수다.

	// 이름이 의미하는것
	// 1. 위치 << 내프로그램의 시작위치에서 n바이트 떨어진 위치에 만들어진다.
			  // <= 주소값으로 치환된다 <= 물리적인 램에서의 위치

} // 함수의 끝
